### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_metric_alert.com_redis_memory_alert will be created
  + resource "azurerm_monitor_metric_alert" "com_redis_memory_alert" {
      + auto_mitigate            = true
      + description              = "Alerts when Redis Cache memory usage exceeds 80%."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-com-redis-02 high memory usage"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Cache/redis/io-p-itn-com-redis-02",
        ]
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Used Memory Percentage"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # azurerm_monitor_metric_alert.com_redis_server_load_alert will be created
  + resource "azurerm_monitor_metric_alert" "com_redis_server_load_alert" {
      + auto_mitigate            = true
      + description              = "Alerts when Redis Cache server load averages above 75% for 5 minutes."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-com-redis-02 high server load"
      + resource_group_name      = "io-p-itn-com-rg-01"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Cache/redis/io-p-itn-com-redis-02",
        ]
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Server Load"
          + metric_namespace       = "Microsoft.Cache/redis"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 75
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>
